src/cf/InformationRegisters/КонтрольСопоставленияНоменклатурыЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтрольСопоставленияНоменклатурыЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящийЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Comment>Владелец номенклатуры</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецНоменклатурыБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КонтрольСопоставленияНоменклатурыЭДО/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ЭлектронныйДокумент - см. РегистрСведений.КонтрольСопоставленияНоменклатурыЭДО.ЭлектронныйДокумент
//  НоменклатураКонтрагента - Структура:
//  * Владелец - см. РегистрСведений.КонтрольСопоставленияНоменклатурыЭДО.Владелец
//  * Идентификатор - см. РегистрСведений.КонтрольСопоставленияНоменклатурыЭДО.Идентификатор
Процедура Записать(ЭлектронныйДокумент, НоменклатураКонтрагента) Экспорт
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокумент);
	Набор.Отбор.Владелец.Установить(НоменклатураКонтрагента.Владелец);
	Набор.Отбор.Идентификатор.Установить(НоменклатураКонтрагента.Идентификатор);
	
	Запись = Набор.Добавить();
	Запись.ЭлектронныйДокумент = ЭлектронныйДокумент;
	Запись.Владелец = НоменклатураКонтрагента.Владелец;
	Запись.Идентификатор = НоменклатураКонтрагента.Идентификатор;
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
